In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
from numpy import NaN

In [19]:
data1={'Name':['a','b','c','d'],
       'Age':[24,34,NaN,78]}

In [20]:
data=pd.DataFrame(data1)

In [21]:
data

  Name   Age
0    a  24.0
1    b  34.0
2    c   NaN
3    d  78.0

In [22]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [23]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [24]:
data['Age'].fillna(data['Age'].mean())

0    24.000000
1    34.000000
2    45.333333
3    78.000000
Name: Age, dtype: float64

In [25]:
data

  Name   Age
0    a  24.0
1    b  34.0
2    c   NaN
3    d  78.0

In [26]:
data['Age'].fillna(data['Age'].std())

0    24.000000
1    34.000000
2    28.728615
3    78.000000
Name: Age, dtype: float64

In [27]:
data['Age'].fillna(data['Age'].max())

0    24.0
1    34.0
2    78.0
3    78.0
Name: Age, dtype: float64

In [29]:
data['Age'].fillna(data['Age'].median())

0    24.0
1    34.0
2    34.0
3    78.0
Name: Age, dtype: float64

In [33]:
data['Age'].fillna(data['Age'].mode())

0    24.0
1    34.0
2    78.0
3    78.0
Name: Age, dtype: float64

In [35]:
data['Age'].fillna(data['Age'].mode()[0])

0    24.0
1    34.0
2    24.0
3    78.0
Name: Age, dtype: float64

In [36]:
data['Age'].mode()

0    24.0
1    34.0
2    78.0
Name: Age, dtype: float64

In [ ]:
The stock span problem is a financial problem where we have a series of daily price quotes for a stock and we need to calculate the span of stock price for all days. The span arr[i] of the stocks price on a given day i is defined as the maximum number of consecutive days just before the given day, for which the price of the stock on the given day is less than or equal to its price on the current day.

Examples:

Input: arr[] = [100, 80, 60, 70, 60, 75, 85]
Output: [1, 1, 1, 2, 1, 4, 6]
Explanation: Traversing the given input span 100 is greater than equal to 100 and there are no more elements behind it so the span is 1, 80 is greater than equal to 80 and smaller than 100 so the span is 1, 60 is greater than equal to 60 and smaller than 80 so the span is 1, 70 is greater than equal to 60,70 and smaller than 80 so the span is 2 and so on.  Hence the output will be 1 1 1 2 1 4 6.